Tekla Open API Reference for Tekla Structures 2025
ReinforcementMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.ReinforcementMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
Cc
Returns the cc property element type.
CcExact
Returns the cc exact property element type.
CcMax
Returns the cc max property element type.
CcMin
Returns the cc min property element type.
CcTarget
Returns the cc target property element type.
Class
Returns the class property element type.
Diameter
Returns the diameter property element type.
Grade
Returns the grade property element type.
Length
Returns the length property element type.
Name
Returns the name property element type.
Number
Returns the number property element type.
Position
Returns the position property element type.
Shape
Returns the shape property element type.
Weight
Returns the weight property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.ReinforcementMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace